@echo off

REM ===============================================================================================================
REM CheckEmptyDir.bat
REM 空ディレクトリを探す
REM ===============================================================================================================

REM ===============================================================================================================
REM for コマンド
REM  書式
REM   for （オプション） %%文字 in (ループ処理の対象) do コマンド
REM
REM   オプション
REM     指定なし : ディレクトリ内を対象にとる。
REM     /r      : ディレクトリ名及びそのサブディレクトリ内（そのフォルダの中のファイル名やフォルダ名）を対象にとる
REM               再帰的に処理されるので全てのサブディレクトリが対象となる。
REM     /f      : ファイルの内容を 1行ずつ取り出して、1行毎にコマンド実行する事が出来ます。
REM                書式：for /f ["オプション文字列"] %変数 in ( 読み込みたいファイル名 ) do 実行するコマンド

REM               または
REM               コマンドを実行して、その結果を1行ずつ取り出して、1行毎にコマンド実行する事が出来ます。
REM               コマンドは''で囲む
REM                書式：for /f ["オプション文字列"] %変数 in ( '実行結果を取り出したいコマンド' ) do 実行するコマンド

REM               または
REM               文字列を区切り文字で分割して変数に入れ、その変数を使ってコマンド実行する事が出来ます。
REM                書式：for /f ["オプション文字列"] %変数 in ( "読み込みたい文字列" ) do 実行するコマンド
REM     /d      : ディレクトリ（フォルダ）名を対象にとる。
REM     /l      : 値を指定して代入する。
REM 
REM   ループ処理の対象
REM     .       : サブディレクトリを列挙 (/rの場合)
REM   
REM   トークンオプション (/fの場合)
REM     tokens=   : 何番目のトークンを指定するか？
REM                 例:
REM                  1-3 : 1～3番目を取得
REM                  1   : 1番目を取得
REM                 複数指定した場合、変数名は勝手に決まる。
REM                 例:
REM                  for /f "tokens=1-3" %%a
REM                  の場合、%%a, %%b, %%c にそれぞれのトークンが入る。
REM     delims=   : トークンの区切り文字を指定する。
REM     eol=      : この文字から始まる行を無視する。
REM     skip=     : 先頭から指定された行数、スキップする。
REM     usebackq= : コマンドの出力を対象にする。
REM
REM   %%文字
REM     for文の変数 (英文字1文字のみ。[a-zA-Z])
REM     参照するときは""で囲む
REM
REM ===============================================================================================================

REM ===============================================================================================================
REM echo コマンド
REM  @echo off  コマンドを表示しない。
REM ===============================================================================================================

REM ===============================================================================================================
REM call コマンド
REM  書式
REM   call :ラベル [引数]
REM ===============================================================================================================

REM ===============================================================================================================
REM if コマンド
REM  書式
REM   if 条件 真コマンド else 偽コマンド
REM
REM  比較演算子
REM   equ　等しい
REM   neq　等しくない
REM   gtr　より大きい
REM   geq　以上
REM   leq　以下
REM   lss　より小さい（＝未満）
REM ===============================================================================================================

REM ===============================================================================================================
REM find コマンド
REM  文字列を検索する。
REM ===============================================================================================================

REM ===============================================================================================================
REM set コマンド
REM  変数に値を設定する。
REM ===============================================================================================================

REM ===============================================================================================================
REM %変数名%     変数を参照する。
REM &           コマンドを続けて実行する。
REM goto :EOF   サブルーチンの終了する。
REM 文字列置換   %[置換対象文字列]:[置き換えられる文字列]=[置き換え後の文字列]%
REM |           パイプ
REM             コマンドの実行結果を次のコマンドに渡す。
REM             (ループ処理の対象)で使用する場合は^でエスケープする必要がある。
REM ===============================================================================================================

REM ===============================================================================================================
REM 参考
REM http://tounderlinedk.blogspot.com/2011/05/for-f-1-for1-windowsbatcmd.html
REM http://tounderlinedk.blogspot.com/2011/05/for-f-2-for1-windowsbatcmd.html
REM http://tounderlinedk.blogspot.com/2011/05/for-f-3-windowsbatcmd.html
REM https://jj-blues.com/cms/wantto-replacestring/
REM ===============================================================================================================


REM サブディレクトリ名を列挙してサブルーチンに1つずつ渡す。
REM
for /r %%d in ( . ) do call :sub "%%d"
pause
exit /b

REM サブルーチン (引数で渡されたディレクトリにファイルがあるかを確認する)
REM  引数(%1) : ディレクトリ名
:sub

REM dirコマンドの結果から、"個のファイル"という文字列がある行を探し、その行を半角SPをデリミタとして分解し、
REM それぞれをトークンとして取得し、fnumとfsizeに設定する。
REM
REM 例：
REM  3 個のファイル                 110 バイト
REM
REM 検索された結果が上記の場合、トークンには以下が設定される。
REM  %%a = 3
REM  %%b = 個のファイル
REM  %%c = 110
REM
REM なので、fnumには3, fsizeには110が入る。
REM
for /f "tokens=1-3" %%a in ('dir %1 ^| find "個のファイル"') do set fnum=%%a & set fsize=%%c

REM fsizeには桁区切りの「,」が入る場合があるので、文字列置換して削除する。
REM 例：
REM  1,234 → 1234
REM
set fsize=%fsize:,=%

REM dirコマンドの結果から、"個のディレクトリ"という文字列がある行を探し、その行を半角SPをデリミタとして分解し、
REM 1つ目のトークンとして取得し、dirに設定する。
REM
REM 例：
REM  3 個のディレクトリ  173,429,383,168 バイトの空き領域
REM
REM 検索された結果が上記の場合、トークンには以下が設定される。
REM  %%a = 3
REM
REM なので、dirには3が入る。
REM
for /f "tokens=1" %%a in ('dir %1 ^| find "個のディレクトリ"') do set dir=%%a

REM ファイル数(fnum) == 0 かつ
REM ファイルサイズ(fsize) == 0 かつ
REM ディレクトリ数(dir) == 2  ※1
REM を満たすとき空のディレクトリと判断し、ディレクトリ名をプロンプトに表示する。
REM
REM ※1
REM 2で判定している理由：特殊ディレクトリ(.と..)を含むため。
REM
if %fnum% equ 0 if %fsize% equ 0 if %dir% equ 2 echo %1

goto :EOF